ams/src/InformationRegisters/СервисСверкиРасчетовСтатусыРасхождений/СервисСверкиРасчетовСтатусыРасхождений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СервисСверкиРасчетовСтатусыРасхождений</name>
  <resources>
    <name>ЭтоНовоеРасхождение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторРасхождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>38</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/InformationRegisters/СервисСверкиРасчетовСтатусыРасхождений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьДанные(ИдентификаторыНовыхРасхождений) Экспорт 
	
	Для Каждого ИдентификаторРасхождения Из ИдентификаторыНовыхРасхождений Цикл
		
		МенеджерЗаписи = РегистрыСведений.СервисСверкиРасчетовСтатусыРасхождений.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИдентификаторРасхождения = ИдентификаторРасхождения;
		МенеджерЗаписи.ЭтоНовоеРасхождение = Истина;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОчиститьСтатусыРасхождений() Экспорт
	
	НаборЗаписейРасхождения= РегистрыСведений.СервисСверкиРасчетовСтатусыРасхождений.СоздатьНаборЗаписей();
	НаборЗаписейРасхождения.Записать();
	
КонецФункции

#КонецОбласти

#КонецЕсли
